jlpoltrack/stm32ll-lib/stdstm32-uart-template.h
typedef enum {
#ifdef LL_USART_STOPBITS_0_5
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART, and some STM32F0!
#endif
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
#ifdef LL_USART_STOPBITS_1_5
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART, and some STM32!
#endif
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UART$_USE_TX_ISR) && (!defined UART$_USE_TX)
  #error UART$_USE_TX_ISR used without UART$_USE_TX!
#endif
#if (defined UART$_USE_RXERRORCOUNT) && (!defined UART$_USE_RX)
  #error UART$_USE_RXERRORCOUNT used without UART$_USE_RX!
#endif

#ifdef UART$_USE_TX_DMA
  #error UART$_USE_TX_DMA not supported by this library!
#endif


#ifndef UART$_BAUD
  #define UART$_BAUD             115200UL // 9600UL
#endif


#ifdef UART$_USE_TX_ISR
  #ifndef UART$_TXBUFSIZE
    #define UART$_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UART$_TXBUFSIZE < 2
    #error UART$_TXBUFSIZE must be larger than 1 !
  #elif ((UART$_TXBUFSIZE & (UART$_TXBUFSIZE-1)) != 0)
    #error UART$_TXBUFSIZE must be a power of 2 !
  #endif

  #define UART$_TXBUFSIZEMASK  (UART$_TXBUFSIZE-1)

  volatile char uart$_txbuf[UART$_TXBUFSIZE];
  volatile uint16_t uart$_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uart$_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UART$_USE_RX
  #ifndef UART$_RXBUFSIZE
    #define UART$_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UART$_RXBUFSIZE < 2
    #error UART$_RXBUFSIZE must be larger than 1 !
  #elif ((UART$_RXBUFSIZE & (UART$_RXBUFSIZE-1)) != 0)
    #error UART$_RXBUFSIZE must be a power of 2 !
  #endif

  #define UART$_RXBUFSIZEMASK  (UART$_RXBUFSIZE-1)

  volatile char uart$_rxbuf[UART$_RXBUFSIZE];
  volatile uint16_t uart$_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uart$_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UART$_USE_RXERRORCOUNT
  volatile uint32_t uart$_errorcnt_rxnoise;
  volatile uint32_t uart$_errorcnt_rxframe;
  volatile uint32_t uart$_errorcnt_rxoverrun;
  #endif
#endif


// catch legacy defines
#if defined UART$_USE_UART1_REMAPPED || defined UART$_USE_UART1_REMAPPED2
  #error REMAPPED not supported anymore!
#endif
#if defined UART$_USE_UART2_REMAPPED || defined UART$_USE_UART2_REMAPPED2 || defined UART$_USE_UART2_REMAPPED3
  #error REMAPPED not supported anymore!
#endif
#if defined UART$_USE_UART3_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UART$_USE_UART4_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UART$_USE_UART6_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UART$_USE_UART7_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UART$_USE_LPUART1_REMAPPED
  #error REMAPPED not supported anymore!
#endif


#if defined UART$_USE_UART1 || defined UART$_USE_UART1_PA9PA10 || defined UART$_USE_UART1_PB6PB7 || defined UART$_USE_UART1_PC4PC5 || \
      defined UART$_USE_UART1_PB14PB15
  #define UART$_UARTx             USART1
  #ifdef UART$_USE_UART1
    // user needs to specify UART$_USE_TX_IO, UART$_USE_RX_IO, and possibly UART$_USE_IO_AF
  #elif defined UART$_USE_UART1_PA9PA10
    #define UART$_TX_IO           IO_PA9
    #define UART$_RX_IO           IO_PA10
  #elif defined UART$_USE_UART1_PB6PB7 // was UART1_REMAPPED
    #define UART$_TX_IO           IO_PB6
    #define UART$_RX_IO           IO_PB7
  #elif defined UART$_USE_UART1_PC4PC5 // only G4 // was UART1_REMAPPED2
    #define UART$_TX_IO           IO_PC4
    #define UART$_RX_IO           IO_PC5
  #elif defined UART$_USE_UART1_PB14PB15 // only C5
    #define UART$_TX_IO           IO_PB14
    #define UART$_RX_IO           IO_PB15
  #endif
  #ifndef STM32F0
    #define UART$_IO_AF           IO_AF_7
  #else
    #ifdef UART$_USE_UART1
      // user needs to specify UART$_USE_IO_AF
    #elif defined UART$_USE_UART1_PA9PA10
      #define UART$_IO_AF         IO_AF_1
    #elif defined UART$_USE_UART1_PB6PB7
      #define UART$_IO_AF         IO_AF_0
    #else
      #error UART$_USE_UART1 mapping not available on STM32F0 !
    #endif
  #endif
  #define UART$_IRQn              USART1_IRQn
  #define UART$_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32C5
    // C5: PA9/PA10 and PB6/PB7 are AF7 as set above, PB14/PB15 are AF4. the AF4 is
    // datasheet-verified on C551/C552/C562, and assumed to hold for the smaller parts.
    // PC4/PC5 is not a USART1 mapping on C5, it is USART3_RX.
    #if defined UART$_USE_UART1_PC4PC5
      #error UART$_USE_UART1_PC4PC5 not available on STM32C5 !
    #elif defined UART$_USE_UART1_PB14PB15
      #undef UART$_IO_AF
      #define UART$_IO_AF         IO_AF_4
    #endif
  #endif

#elif defined UART$_USE_UART2 || defined UART$_USE_UART2_PA2PA3 || defined UART$_USE_UART2_PD5PD6 || \
      defined UART$_USE_UART2_PB3PB4 || defined UART$_USE_UART2_PA14PA15 || defined UART$_USE_UART2_PB3PA15 || \
      defined UART$_USE_UART2_PA5PA15
  #define UART$_UARTx             USART2
  #ifdef UART$_USE_UART2
    // user needs to specify UART$_USE_TX_IO, UART$_USE_RX_IO, and possibly UART$_USE_IO_AF
  #elif defined UART$_USE_UART2_PA2PA3
    #define UART$_TX_IO           IO_PA2
    #define UART$_RX_IO           IO_PA3
  #elif defined UART$_USE_UART2_PD5PD6 // was UART2_REMAPPED
    #define UART$_TX_IO           IO_PD5
    #define UART$_RX_IO           IO_PD6
  #elif defined UART$_USE_UART2_PB3PB4 // only G4 // was UART2_REMAPPED2
    #define UART$_TX_IO           IO_PB3
    #define UART$_RX_IO           IO_PB4
  #elif defined UART$_USE_UART2_PA14PA15 // only G4, F0 // ATTENTION: on G4 PA14 overlaps with SWCLK // was UART2_REMAPPED3
    #define UART$_TX_IO           IO_PA14
    #define UART$_RX_IO           IO_PA15
  #elif defined UART$_USE_UART2_PB3PA15 // only G4
    #define UART$_TX_IO           IO_PB3
    #define UART$_RX_IO           IO_PA15
  #endif
  #ifndef STM32F0
    #define UART$_IO_AF           IO_AF_7
  #else
    #if defined UART$_USE_UART2
      // user needs to specify UART$_USE_IO_AF
    #elif defined UART$_USE_UART2_PA2PA3 || defined UART$_USE_UART2_PA14PA15
      #define UART$_IO_AF         IO_AF_1
    #else
      #error UART$_USE_UART2 mapping not available on STM32F0 !
    #endif
  #endif
  #define UART$_IRQn              USART2_IRQn
  #define UART$_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32C5
    // C5 has USART2 only on PA2/PA3 (AF7, as set above) and PD5/PD6, and PD5/PD6 is not
    // bonded up to LQFP64. PB3/PB4 and PB3/PA15 are USART3 pins on C5, not USART2.
    #if defined UART$_USE_UART2_PD5PD6
      #error UART$_USE_UART2_PD5PD6 not bonded on STM32C5 packages up to LQFP64 ! use UART$_USE_UART2_PA2PA3
    #elif defined UART$_USE_UART2_PB3PB4 || defined UART$_USE_UART2_PA14PA15 || \
          defined UART$_USE_UART2_PB3PA15
      #error UART$_USE_UART2 mapping not available on STM32C5 ! use UART$_USE_UART2_PA2PA3
    #endif
  #endif

#elif defined UART$_USE_UART3 || defined UART$_USE_UART3_PB10PB11 || defined UART$_USE_UART3_PC10PC11 || defined UART$_USE_UART3_PB8PB9 || \
      defined UART$_USE_UART3_PA4PA3 || defined UART$_USE_UART3_PB3PB8
  #define UART$_UARTx             USART3
  #if defined UART$_USE_UART3
    // user needs to specify UART$_USE_TX_IO, UART$_USE_RX_IO, and possibly UART$_USE_IO_AF
  #elif defined UART$_USE_UART3_PB10PB11
    #define UART$_TX_IO           IO_PB10
    #define UART$_RX_IO           IO_PB11
  #elif defined UART$_USE_UART3_PC10PC11 // was UART3_REMAPPED
    #define UART$_TX_IO           IO_PC10
    #define UART$_RX_IO           IO_PC11
  #elif defined UART$_USE_UART3_PB8PB9 // only F3
    #define UART$_TX_IO           IO_PB8
    #define UART$_RX_IO           IO_PB9
  #else
  #endif
  #ifndef STM32F0
    #define UART$_IO_AF           IO_AF_7
  #else
    #if defined UART$_USE_UART3
      // user needs to specify UART$_USE_IO_AF
    #elif defined defined UART$_USE_UART3_PB10PB11 || defined UART$_USE_UART3_PB8PB9
      #define UART$_IO_AF         IO_AF_4
    #elif defined UART$_USE_UART3_PC10PC11
      #define UART$_IO_AF         IO_AF_1
    #else
      #error UART$_USE_UART3 mapping not available on STM32F0 !
    #endif
  #endif
  #define UART$_IRQn              USART3_IRQn
  #define UART$_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UART$_IRQn
    #undef UART$_IRQHandler
    #define UART$_IRQn            USART3_4_IRQn
    #define UART$_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32C5
    // C5 USART3 is AF7 as set above, and only PC10/PC11 is bonded up to LQFP64.
    // PB3/PB4 is USART3 too, but on AF11, and is not offered as a mapping here.
    // the C5 parts without USART3 are caught by the CMSIS presence macro.
    #if !defined USART3
      #error UART3 NOT AVAILABLE !
    #elif defined UART$_USE_UART3_PB10PB11
      #error UART$_USE_UART3_PB10PB11 not available on STM32C5, PB11 is not a USART3 pin ! use UART$_USE_UART3_PC10PC11
    #elif defined UART$_USE_UART3_PB8PB9
      #error UART$_USE_UART3_PB8PB9 not available on STM32C5 ! use UART$_USE_UART3_PC10PC11
    #endif
  #endif

#elif defined UART$_USE_UART4 || defined UART$_USE_UART4_PC10PC11 || defined UART$_USE_UART4_PA0PA1
  #define UART$_UARTx             UART4
  #ifdef UART$_USE_UART4
    // user needs to specify UART$_USE_TX_IO, UART$_USE_RX_IO, and possibly UART$_USE_IO_AF
  #elif defined UART$_USE_UART4_PC10PC11
    #define UART$_TX_IO           IO_PC10
    #define UART$_RX_IO           IO_PC11
  #elif defined UART$_USE_UART4_PA0PA1 // only F7, C5 // was UART4_REMAPPED
    #define UART$_TX_IO           IO_PA0
    #define UART$_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UART$_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UART$_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UART$_IO_AF           IO_AF_5
  #elif defined STM32C5
    #define UART$_IO_AF           IO_AF_8
  #endif
  #define UART$_IRQn              UART4_IRQn
  #define UART$_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UART$ IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UART$_IRQn
    #undef UART$_IRQHandler
    #define UART$_IRQn            USART3_4_IRQn
    #define UART$_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32C5
  #endif

#elif defined UART$_USE_UART5 || defined UART$_USE_UART5_PC12PD2
  #define UART$_UARTx             UART5
  #ifdef UART$_USE_UART5
    // user needs to specify UART$_USE_TX_IO, UART$_USE_RX_IO, and possibly UART$_USE_IO_AF
  #elif defined UART$_USE_UART5_PC12PD2
    #define UART$_TX_IO           IO_PC12
    #define UART$_RX_IO           IO_PD2
  #endif
  #define UART$_IRQn              UART5_IRQn
  #define UART$_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UART$_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UART$ IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UART$_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UART$_IO_AF           IO_AF_5
  #elif defined STM32C5
    #define UART$_IO_AF           IO_AF_8
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #endif

#elif defined UART$_USE_UART6 || defined UART$_USE_UART6_PC6PC7 || defined UART$_USE_UART6_PG14PG9
  #define UART$_UARTx             USART6
  #ifdef UART$_USE_UART6
    // user needs to specify UART$_USE_TX_IO, UART$_USE_RX_IO, and possibly UART$_USE_IO_AF
  #elif defined UART$_USE_UART6_PC6PC7
    #define UART$_TX_IO           IO_PC6
    #define UART$_RX_IO           IO_PC7
  #elif defined UART$_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UART$_TX_IO           IO_PG14
    #define UART$_RX_IO           IO_PG9
  #endif
  #define UART$_IO_AF             IO_AF_8
  #define UART$_IRQn              USART6_IRQn
  #define UART$_IRQHandler        USART6_IRQHandler

